Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME70_DFP/3.0.3/Microchip.SAME70_DFP.pdsc
         <device Dname="ATSAME70J20">
            <processor Dcore="Cortex-M7" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <compile header="same70a/include/sam.h" define="__SAME70J20__"/>
            <debug svd="same70a/svd/ATSAME70J20.svd"/>
            <memory id="IROM1" start="0x00400000" size="0x00100000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
            <algorithm name="same70a/keil/flash/ATSAME7x_1024.FLM" start="0x00400000" size="0x00100000" default="1"/>
            <algorithm name="same70a/keil/flash/ATSAME7x_GPNVM.FLM" start="0x1FFFFFF0" size="0x00000010" default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="same70a/atdf/ATSAME70J20.atdf"/>
                  <at:variant ordercode="ATSAME70J20A-AN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW" address-space="base"/>
                  <at:memory name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IFLASH" start="0x00400000" size="0x00100000" type="flash" pagesize="512" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true" address-space="base"/>
                  <at:memory name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IRAM" start="0x20400000" size="0x00060000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="SDRAM_CS" start="0x70000000" size="0x10000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="same70a/edc/ATSAME70J20.PIC"/>
               </mchp:extension>
            </environment>
            <description>ARM&#174; Cortex&#174;-M7 microcontroller with 1MB Flash, 384kB SRAM, QSPI, 10/100Mbps Ethernet-AVB MAC with traffic shaping, CAN-FD, Full-Speed USB Host and Device, CMOS Camera Interface, Single ADC and DAC, 1 Analog Comparator, 1 SSC, 2 USARTs/SPI, 1 SPI, 2 TWI, 3 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, 64 pins</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAME70J20" title="Device page for ATSAME70J20"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAME70J20" title="Datasheet"/>
         </device>
         <device Dname="ATSAME70Q21B">
            <processor Dcore="Cortex-M7" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <compile header="same70b/include/sam.h" define="__SAME70Q21B__"/>
            <debug svd="same70b/svd/ATSAME70Q21B.svd"/>
            <memory id="IROM1" start="0x00400000" size="0x00200000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
            <algorithm name="same70b/keil/flash/ATSAME7x_2048.FLM" start="0x00400000" size="0x00200000" default="1"/>
            <algorithm name="same70b/keil/flash/ATSAME7x_GPNVM.FLM" start="0x1FFFFFF0" size="0x00000010" default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="same70b/atdf/ATSAME70Q21B.atdf"/>
                  <at:variant ordercode="ATSAME70Q21B-CN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:variant ordercode="ATSAME70Q21B-AN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:variant ordercode="ATSAME70Q21B-CFN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW" address-space="base"/>
                  <at:memory name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IFLASH" start="0x00400000" size="0x00200000" type="flash" pagesize="512" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true" address-space="base"/>
                  <at:memory name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IRAM" start="0x20400000" size="0x00060000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS0" start="0x60000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS1" start="0x61000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS2" start="0x62000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS3" start="0x63000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="SDRAM_CS" start="0x70000000" size="0x10000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="same70b/edc/ATSAME70Q21B.PIC"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAME70Q21B" title="Device page for ATSAME70Q21B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAME70Q21B" title="Datasheet"/>
         </device>
