Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME70_DFP/3.0.3/Microchip.SAME70_DFP.pdsc
         <device Dname="ATSAME70N20">
            <processor Dcore="Cortex-M7" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <compile header="same70a/include/sam.h" define="__SAME70N20__"/>
            <debug svd="same70a/svd/ATSAME70N20.svd"/>
            <memory id="IROM1" start="0x00400000" size="0x00100000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
            <algorithm name="same70a/keil/flash/ATSAME7x_1024.FLM" start="0x00400000" size="0x00100000" default="1"/>
            <algorithm name="same70a/keil/flash/ATSAME7x_GPNVM.FLM" start="0x1FFFFFF0" size="0x00000010" default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="same70a/atdf/ATSAME70N20.atdf"/>
                  <at:variant ordercode="ATSAME70N20A-CN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:variant ordercode="ATSAME70N20A-AN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW" address-space="base"/>
                  <at:memory name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IFLASH" start="0x00400000" size="0x00100000" type="flash" pagesize="512" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true" address-space="base"/>
                  <at:memory name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IRAM" start="0x20400000" size="0x00060000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="SDRAM_CS" start="0x70000000" size="0x10000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="same70a/edc/ATSAME70N20.PIC"/>
               </mchp:extension>
            </environment>
            <description>ARM&#174; Cortex&#174;-M7 microcontroller with 1MB Flash, 384kB SRAM, QSPI, 10/100Mbps Ethernet-AVB MAC with traffic shaping, dual CAN-FD, SD/MMC, High-speed USB Host and Device, CMOS Camera Interface, Dual ADC, DAC, 1 Analog Comparator, 1 SSC, 3 USARTs/SPI, 1 SPI, 3 TWI, 5 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, 100 pins</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAME70N20" title="Device page for ATSAME70N20"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAME70N20" title="Datasheet"/>
         </device>
         <device Dname="ATSAME70N21B">
            <processor Dcore="Cortex-M7" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <compile header="same70b/include/sam.h" define="__SAME70N21B__"/>
            <debug svd="same70b/svd/ATSAME70N21B.svd"/>
            <memory id="IROM1" start="0x00400000" size="0x00200000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
            <algorithm name="same70b/keil/flash/ATSAME7x_2048.FLM" start="0x00400000" size="0x00200000" default="1"/>
            <algorithm name="same70b/keil/flash/ATSAME7x_GPNVM.FLM" start="0x1FFFFFF0" size="0x00000010" default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="same70b/atdf/ATSAME70N21B.atdf"/>
                  <at:variant ordercode="ATSAME70N21B-CN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:variant ordercode="ATSAME70N21B-AN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW" address-space="base"/>
                  <at:memory name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IFLASH" start="0x00400000" size="0x00200000" type="flash" pagesize="512" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true" address-space="base"/>
                  <at:memory name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IRAM" start="0x20400000" size="0x00060000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="same70b/edc/ATSAME70N21B.PIC"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAME70N21B" title="Device page for ATSAME70N21B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAME70N21B" title="Datasheet"/>
         </device>
         <device Dname="ATSAME70N20B">
            <processor Dcore="Cortex-M7" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <compile header="same70b/include/sam.h" define="__SAME70N20B__"/>
            <debug svd="same70b/svd/ATSAME70N20B.svd"/>
            <memory id="IROM1" start="0x00400000" size="0x00100000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
            <algorithm name="same70b/keil/flash/ATSAME7x_1024.FLM" start="0x00400000" size="0x00100000" default="1"/>
            <algorithm name="same70b/keil/flash/ATSAME7x_GPNVM.FLM" start="0x1FFFFFF0" size="0x00000010" default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="same70b/atdf/ATSAME70N20B.atdf"/>
                  <at:variant ordercode="ATSAME70N20B-CN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:variant ordercode="ATSAME70N20B-AN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW" address-space="base"/>
                  <at:memory name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IFLASH" start="0x00400000" size="0x00100000" type="flash" pagesize="512" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true" address-space="base"/>
                  <at:memory name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IRAM" start="0x20400000" size="0x00060000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="same70b/edc/ATSAME70N20B.PIC"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAME70N20B" title="Device page for ATSAME70N20B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAME70N20B" title="Datasheet"/>
         </device>
         <device Dname="ATSAME70N19B">
            <processor Dcore="Cortex-M7" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <compile header="same70b/include/sam.h" define="__SAME70N19B__"/>
            <debug svd="same70b/svd/ATSAME70N19B.svd"/>
            <memory id="IROM1" start="0x00400000" size="0x00080000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00040000" default="1"/>
            <algorithm name="same70b/keil/flash/ATSAME7x_512.FLM" start="0x00400000" size="0x00080000" default="1"/>
            <algorithm name="same70b/keil/flash/ATSAME7x_GPNVM.FLM" start="0x1FFFFFF0" size="0x00000010" default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="same70b/atdf/ATSAME70N19B.atdf"/>
                  <at:variant ordercode="ATSAME70N19B-CN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:variant ordercode="ATSAME70N19B-AN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW" address-space="base"/>
                  <at:memory name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IFLASH" start="0x00400000" size="0x00080000" type="flash" pagesize="512" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true" address-space="base"/>
                  <at:memory name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IRAM" start="0x20400000" size="0x00040000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="same70b/edc/ATSAME70N19B.PIC"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAME70N19B" title="Device page for ATSAME70N19B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAME70N19B" title="Datasheet"/>
         </device>
