Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME70_DFP/3.0.3/Microchip.SAME70_DFP.pdsc
         <device Dname="ATSAME70Q19B">
            <processor Dcore="Cortex-M7" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <compile header="same70b/include/sam.h" define="__SAME70Q19B__"/>
            <debug svd="same70b/svd/ATSAME70Q19B.svd"/>
            <memory id="IROM1" start="0x00400000" size="0x00080000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00040000" default="1"/>
            <algorithm name="same70b/keil/flash/ATSAME7x_512.FLM" start="0x00400000" size="0x00080000" default="1"/>
            <algorithm name="same70b/keil/flash/ATSAME7x_GPNVM.FLM" start="0x1FFFFFF0" size="0x00000010" default="0"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="same70b/atdf/ATSAME70Q19B.atdf"/>
                  <at:variant ordercode="ATSAME70Q19B-CN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:variant ordercode="ATSAME70Q19B-AN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:variant ordercode="ATSAME70Q19B-CFN" vccmin="1.62" vccmax="3.6" tempmin="-40" tempmax="+105"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SYSTEM" start="0xE0000000" size="0x10000000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="QSPIMEM" start="0x80000000" size="0x20000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AXIMX" start="0xA0000000" size="0x00100000" type="other" rw="RW" address-space="base"/>
                  <at:memory name="ITCM" start="0x00000000" size="0x00200000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IFLASH" start="0x00400000" size="0x00080000" type="flash" pagesize="512" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IROM" start="0x00800000" size="0x00004000" type="rom" exec="true" address-space="base"/>
                  <at:memory name="DTCM" start="0x20000000" size="0x00020000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="IRAM" start="0x20400000" size="0x00040000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS0" start="0x60000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS1" start="0x61000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS2" start="0x62000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="EBI_CS3" start="0x63000000" size="0x01000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="SDRAM_CS" start="0x70000000" size="0x10000000" type="other" rw="RW" exec="true" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="same70b/edc/ATSAME70Q19B.PIC"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAME70Q19B" title="Device page for ATSAME70Q19B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAME70Q19B" title="Datasheet"/>
         </device>
      </family>
   </devices>
   <conditions>
      <condition id="ARMCC">
         <accept Tcompiler="ARMCC"/>
      </condition>
      <condition id="ARMCC Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
      </condition>
      <condition id="GCC">
         <accept Tcompiler="GCC"/>
      </condition>
      <condition id="GCC Exe">
         <accept Tcompiler="GCC" Toutput="exe"/>
      </condition>
      <condition id="IAR">
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="IAR Exe">
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C">
         <accept Tcompiler="ARMCC"/>
         <accept Tcompiler="GCC"/>
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="C Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
         <accept Tcompiler="GCC" Toutput="exe"/>
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C Lib">
         <accept Tcompiler="ARMCC" Toutput="lib"/>
         <accept Tcompiler="GCC" Toutput="lib"/>
         <accept Tcompiler="IAR" Toutput="lib"/>
      </condition>
