Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME70_DFP/3.0.3/Microchip.SAME70_DFP.pdsc
      <condition id="ATSAME70J19">
         <require Dvendor="Microchip:3" Dname="ATSAME70J19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70Q20">
         <require Dvendor="Microchip:3" Dname="ATSAME70Q20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70Q21">
         <require Dvendor="Microchip:3" Dname="ATSAME70Q21"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70N19">
         <require Dvendor="Microchip:3" Dname="ATSAME70N19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70J21">
         <require Dvendor="Microchip:3" Dname="ATSAME70J21"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70J20">
         <require Dvendor="Microchip:3" Dname="ATSAME70J20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70Q21B">
         <require Dvendor="Microchip:3" Dname="ATSAME70Q21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70J21B">
         <require Dvendor="Microchip:3" Dname="ATSAME70J21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70J20B">
         <require Dvendor="Microchip:3" Dname="ATSAME70J20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70Q19">
         <require Dvendor="Microchip:3" Dname="ATSAME70Q19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70Q20B">
         <require Dvendor="Microchip:3" Dname="ATSAME70Q20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70J19B">
         <require Dvendor="Microchip:3" Dname="ATSAME70J19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70N21">
         <require Dvendor="Microchip:3" Dname="ATSAME70N21"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70N20">
         <require Dvendor="Microchip:3" Dname="ATSAME70N20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70N21B">
         <require Dvendor="Microchip:3" Dname="ATSAME70N21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70N20B">
         <require Dvendor="Microchip:3" Dname="ATSAME70N20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70N19B">
         <require Dvendor="Microchip:3" Dname="ATSAME70N19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME70Q19B">
         <require Dvendor="Microchip:3" Dname="ATSAME70Q19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAME70J19">
         <description>Headers and startup code for Microchip ATSAME70J19</description>
         <files>
            <file condition="C" category="include" name="same70a/include"/>
            <file condition="C" category="header" name="same70a/include/sam.h"/>
            <file condition="C Exe" category="source" name="same70a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="same70a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="same70a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="same70a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="same70a/gcc/gcc/startup_same70j19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="same70a/gcc/system_same70j19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="same70a/gcc/gcc/same70j19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="same70a/gcc/gcc/same70j19_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="same70a/armcc/Device/Source/system_same70j19.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="same70a/armcc/Device/Source/ARM/startup_SAME70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="same70a/iar/iar/startup_same70j19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="same70a/iar/system_same70j19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="same70a/iar/config/linker/Microchip/atsame70j19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="same70a/iar/config/linker/Microchip/atsame70j19/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAME70Q20">
         <description>Headers and startup code for Microchip ATSAME70Q20</description>
         <files>
            <file condition="C" category="include" name="same70a/include"/>
            <file condition="C" category="header" name="same70a/include/sam.h"/>
            <file condition="C Exe" category="source" name="same70a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="same70a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="same70a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="same70a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="same70a/gcc/gcc/startup_same70q20.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="same70a/gcc/system_same70q20.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="same70a/gcc/gcc/same70q20_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="same70a/gcc/gcc/same70q20_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="same70a/armcc/Device/Source/system_same70q20.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="same70a/armcc/Device/Source/ARM/startup_SAME70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="same70a/iar/iar/startup_same70q20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="same70a/iar/system_same70q20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="same70a/iar/config/linker/Microchip/atsame70q20/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="same70a/iar/config/linker/Microchip/atsame70q20/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAME70Q21">
         <description>Headers and startup code for Microchip ATSAME70Q21</description>
         <files>
            <file condition="C" category="include" name="same70a/include"/>
            <file condition="C" category="header" name="same70a/include/sam.h"/>
            <file condition="C Exe" category="source" name="same70a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="same70a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="same70a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="same70a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="same70a/gcc/gcc/startup_same70q21.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="same70a/gcc/system_same70q21.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="same70a/gcc/gcc/same70q21_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="same70a/gcc/gcc/same70q21_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="same70a/armcc/Device/Source/system_same70q21.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="same70a/armcc/Device/Source/ARM/startup_SAME70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="same70a/iar/iar/startup_same70q21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="same70a/iar/system_same70q21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="same70a/iar/config/linker/Microchip/atsame70q21/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="same70a/iar/config/linker/Microchip/atsame70q21/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAME70N19">
         <description>Headers and startup code for Microchip ATSAME70N19</description>
         <files>
            <file condition="C" category="include" name="same70a/include"/>
            <file condition="C" category="header" name="same70a/include/sam.h"/>
            <file condition="C Exe" category="source" name="same70a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="same70a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="same70a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="same70a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="same70a/gcc/gcc/startup_same70n19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="same70a/gcc/system_same70n19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="same70a/gcc/gcc/same70n19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="same70a/gcc/gcc/same70n19_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="same70a/armcc/Device/Source/system_same70n19.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="same70a/armcc/Device/Source/ARM/startup_SAME70.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="same70a/iar/iar/startup_same70n19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="same70a/iar/system_same70n19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="same70a/iar/config/linker/Microchip/atsame70n19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="same70a/iar/config/linker/Microchip/atsame70n19/flash.icf" attr="config"/>
         </files>
      </component>
